# SetIntegerValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..SetIntegerValue Method
ColorFillSchemeEntry Class See Also
---
Sets new Integer value of entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetIntegerValue(
	int value
)
```

Visual Basic
---
```text
Public Sub SetIntegerValue ( _
	value As Integer _
)
```

Visual C++
---
```text
public:
void SetIntegerValue(
	int value
)
```

# ### Parameters
value
    Type: System..::..Int32
# Remarks
You should only use this method if the StorageType property reports the type of the entry as a Integer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The entry has different storage type with Integer. |

# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace